Repository: FIRST-Tech-Challenge/ftcdocs-translations
Catalog: locale/*/LC_MESSAGES/control_hard_compon.po
Languages: es

source: A Magnetic Limit Switch is used to detect the presence of a magnet in near proximity. This is commonly used to limit the range of movement of a mechanism that would cause damage if it went beyond said limit. This is done by placing a magnet on said mechanism which would cause the Limit Switch to activate. It is important to note that as a digital device this will only send out a boolean output and not a range. For measuring the strength of a magnetic field take a look at a magnetometer.
es: Se utiliza un interruptor de límite magnético para detectar la presencia de un imán en las proximidades. Esto se usa comúnmente para limitar el rango de movimiento de un mecanismo que causaría daño si fuera más allá de dicho límite. Esto se hace colocando un imán en dicho mecanismo que provocaría la activación del interruptor de límite. Es importante tener en cuenta que, como dispositivo digital, solo enviará una salida booleana y no un rango. Para medir la fuerza de un campo magnético, eche un vistazo a un magnetómetro.

source: Navigation Sensor
es: sensor de navegación

source: An Interial Measurement Unit (IMU) is a sensor that is a combination of a Gyroscope, Accelerometer, and Magnetometer. A Gyroscope is a device that reports the `angular orientation <https://en.wikipedia.org/wiki/Orientation_(geometry)>`_ of an object in 3 dimensions. An Accelerometer is a device that reports the acceleration of an object in 3 dimensions. Acceleration can be thought of as the rate of change of speed at any given instant. A Magnetometer is a device that measures the strength of magnetic fields in 3 axes. This can be used as a compass to gain the orientation of a robot relative to the poles of the Earth, an absolute measurement.
es: Una unidad de medida interna (IMU) es un sensor que es una combinación de un giroscopio, un acelerómetro y un magnetómetro. Un giroscopio es un dispositivo que informa la `orientación angular<https://en.wikipedia.org/wiki/Orientation_(geometry)> `_ de un objeto en 3 dimensiones. Un acelerómetro es un dispositivo que informa la aceleración de un objeto en 3 dimensiones. La aceleración se puede considerar como la tasa de cambio de velocidad en cualquier instante dado. Un magnetómetro es un dispositivo que mide la fuerza de los campos magnéticos en 3 ejes. Esto se puede utilizar como una brújula para obtener la orientación de un robot en relación con los polos de la Tierra, una medida absoluta.

source: Potentiometer
es: Potenciómetro

source: REV Potentiometer
es: Potenciómetro REV

source: 50k Ohm Potentiometer
es: Potenciómetro de 50k ohmios

source: A Potentiometer is a device that changes the output voltage based upon the degree to which the adjuster is turned. It is often used as a form of measuring the absolute orientation of an axle. The manner in which the output voltage changes is based on the Potentiometer that is used. Such a device is typically attatched via the analog port of the REV Hub.
es: Un potenciómetro es un dispositivo que cambia el voltaje de salida según el grado en que se gira el ajustador. A menudo se utiliza como una forma de medir la orientación absoluta de un eje. La forma en que cambia el voltaje de salida se basa en el potenciómetro que se utiliza. Dicho dispositivo generalmente se conecta a través del puerto analógico del REV Hub.

source: :ref:`Analog Port Overview <control_hard_compon/rc_components/hub/ports/ch-ports:analog ports>`
es: :ref:`Descripción general del puerto analógico<control_hard_compon/rc_components/hub/ports/ch-ports:analog ports> `

source: :ref:`Digital Port Overview <control_hard_compon/rc_components/hub/ports/ch-ports:digital ports>`
es: :ref:`Descripción general del puerto digital<control_hard_compon/rc_components/hub/ports/ch-ports:digital ports> `

source: :ref:`I2C Port Overview <control_hard_compon/rc_components/hub/ports/ch-ports:i2c ports>`
es: :ref:`Resumen del puerto I2C<control_hard_compon/rc_components/hub/ports/ch-ports:i2c ports> `

source: REV Smart Robot Servo (SRS)
es: Servo de robot inteligente REV (SRS)

source: goBILDA Dual Mode Servo
es: servo de modo dual goBILDA

source: GB 2000-0025-0504
es: ES 2000-0025-0504

source: Hitec Conventional Servo
es: Servo convencional Hitec

source: A servo is a type of device that takes a Pulse-Width Modulated (PWM) signal as an input and, with the help of an embedded controller, produces linear or rotational movement based upon the input signal. Servos may take an input signal generated by a REV Hub (either by a Control Hub or Expansion Hub) which itself provides 5V of power and a limited amount of current (see REV Documentation for more information). A REV Servo Power Module (SPM) may be utilized to boost the power provided to servos to a maximum of 90W at 6V for up to 6 servos per device. Robots in *FIRST* Tech Challenge may employ up to 12 total servos.
es: Un servo es un tipo de dispositivo que toma una señal modulada por ancho de pulso (PWM) como entrada y, con la ayuda de un controlador incorporado, produce un movimiento lineal o rotacional basado en la señal de entrada. Los servos pueden tomar una señal de entrada generada por un concentrador REV (ya sea por un concentrador de control o un concentrador de expansión) que a su vez proporciona 5 V de potencia y una cantidad limitada de corriente (consulte la documentación de REV para obtener más información). Se puede utilizar un módulo de potencia servo REV (SPM) para aumentar la potencia proporcionada a los servos a un máximo de 90 W a 6 V para hasta 6 servos por dispositivo. Los robots en *FIRST* Tech Challenge pueden emplear hasta 12 servos en total.

source: :ref:`Port Overview <control_hard_compon/rc_components/hub/ports/ch-ports:servo ports>`
es: :ref:`Vista general del puerto<control_hard_compon/rc_components/hub/ports/ch-ports:servo ports> `

source: :ref:`Connecting Servos <hardware_and_software_configuration/connecting_devices/connecting_servo/connecting-servo:connecting a servo to the hub>`
es: :ref:`Conexión de servos <hardware_and_software_configuration/connecting_devices/connecting_servo/connecting-servo:connecting a servo to the hub> `

source: :ref:`Configuring Servos <hardware_and_software_configuration/configuring/configuring_servo/configuring-servo:configuring a servo>`
es: :ref:`Configuración de servos <hardware_and_software_configuration/configuring/configuring_servo/configuring-servo:configuring a servo> `

source: :ref:`REV Servo Power Module <control_hard_compon/rc_components/power_distr/power-distr:rev servo power module>`
es: :ref:`REV Módulo de servoalimentación<control_hard_compon/rc_components/power_distr/power-distr:rev servo power module> `

source: UVC Webcam
es: Cámara web UVC

source: A webcam is a device that provides visual images of the surrounding environment. For use as part of *FIRST* Tech Challenge teams must use a COTS `UVC <https://www.usb.org/document-library/video-class-v15-document-set>`_ (USB Video Class) Compatible Camera. This device can be connected directly to the REV Control Hub or to the Robot Control system via a powered USB hub ``<RE14>``. This device is intended to be used in vision related tasks. An example use case of a webcam is reading the state of the barcode after randomization, a vision task in *Freight Frenzy*, 2021-2022.
es: Una cámara web es un dispositivo que proporciona imágenes visuales del entorno circundante. Para usar como parte de *FIRST* Tech Challenge, los equipos deben usar un COTS `UVC<https://www.usb.org/document-library/video-class-v15-document-set> Cámara compatible `_ (clase de vídeo USB). Este dispositivo se puede conectar directamente al concentrador de control REV o al sistema de control de robot a través de un concentrador USB con alimentación ``<RE14> ``. Este dispositivo está diseñado para ser utilizado en tareas relacionadas con la visión. Un ejemplo de caso de uso de una cámara web es leer el estado del código de barras después de la aleatorización, una tarea de visión en *Freight Frenzy*, 2021-2022.

source: :ref:`Connecting UVC Camera via Powered USB Hub <hardware_and_software_configuration/configuring/configuring_uvc_camera/configuring-uvc-camera:configuring an external uvc camera and a powered usb hub>`
es: :ref:`Conexión de la cámara UVC a través de un concentrador USB alimentado <hardware_and_software_configuration/configuring/configuring_uvc_camera/configuring-uvc-camera:configuring an external uvc camera and a powered usb hub> `

source: :ref:`Connecting UVC Camera directly to REV Control Hub <hardware_and_software_configuration/configuring/configuring_external_webcam/configuring-external-webcam:configuring an external webcam with a control hub>`
es: :ref:`Conexión de la cámara UVC directamente al concentrador de control REV <hardware_and_software_configuration/configuring/configuring_external_webcam/configuring-external-webcam:configuring an external webcam with a control hub> `

source: :ref:`USB Port Overview <control_hard_compon/rc_components/hub/ports/ch-ports:USB-A Ports>`
es: :ref:`Resumen del puerto USB<control_hard_compon/rc_components/hub/ports/ch-ports:USB-A Ports> `

source: :ref:`Vision in FIRST Tech Challenge <programming_resources/index:vision programming>`
es: :ref:`Visión en FIRST Tech Challenge<programming_resources/index:vision programming> `
