Repository: FIRST-Tech-Challenge/ftcdocs-translations
Catalog: locale/*/LC_MESSAGES/control_hard_compon.po
Languages: es

source: These 4-pin `JST-PH <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485>`_ style connectors are used for your analog inputs. There are 2 of these ports on each hub. These ports have 4 channels labeled from 0-4. This port can be used to connect to a standalone analog sensor. A common example of an analog sensor is a `potentiometer <https://www.revrobotics.com/rev-31-1155/>`_. An analog sensor is one that outputs a range of values rather than digital which alternates between one of two states. For more information on this port please see `REV Analog Port Documentation <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#analog-port-specifications>`_.
es: Estos `JST-PH de 4 pines <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485> Los conectores de estilo `_ se utilizan para sus entradas analógicas. Hay 2 de estos puertos en cada concentrador. Estos puertos tienen 4 canales etiquetados del 0 al 4. Este puerto se puede utilizar para conectarse a un sensor analógico independiente. Un ejemplo común de un sensor analógico es un `potenciómetro<https://www.revrobotics.com/rev-31-1155/> `_. Un sensor analógico es uno que emite un rango de valores en lugar de digital que alterna entre uno de dos estados. Para obtener más información sobre este puerto, consulte `Documentación del puerto analógico REV <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#analog-port-specifications> `_.

source: Digital Ports
es: Puertos digitales

source: These 4-pin `JST-PH <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485>`_ style connectors are used for your digital inputs. There are 4 of these ports on each hub with a total of 8 channels labeled from `0-7`. A device attached to a digital port alternates between one of two states (e.g., on and off). One such device would be a button. It is important to note that each port has two channels and devices such as the `REV Touch Sensor <https://www.revrobotics.com/rev-31-1425/>`_ will only operate on one channel (N+1).
es: Estos `JST-PH de 4 pines <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485> Los conectores de estilo `_ se utilizan para sus entradas digitales. Hay 4 de estos puertos en cada concentrador con un total de 8 canales etiquetados de `0-7`. Un dispositivo conectado a un puerto digital alterna entre uno de dos estados (por ejemplo, encendido y apagado). Uno de esos dispositivos sería un botón. Es importante tener en cuenta que cada puerto tiene dos canales y dispositivos como el `REV Touch Sensor<https://www.revrobotics.com/rev-31-1425/> `_ solo operará en un canal (N+1).

source: I2C Ports
es: Puertos I2C

source: Todo
es: Hacer

source: TODO [uvidyadharan] Add reference to I2C Driver creation tutorial once migrated
es: TODO [uvidyadharan] Agregar referencia al tutorial de creación de controladores I2C una vez migrado

source: These 4-pin `JST-PH <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485>`_ style connectors are used for connecting I2C sensors. Each port is a single I2C bus where multiple sensors can be attached. Using sensors with identical addresses on the same bus can cause problems. The range of I2C sensors that can be connected is limited by :ref:`Game Manual Part 1 <manuals/game_manuals/game_manuals:game manuals>`. While it is possible to use a large range of sensors, the vast majority of I2C sensors do not have drivers built into the SDK. It is possible to use community drivers or create your own. For more information on this port please see `REV I2C Port Documentation <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#i2c-port-specifications>`_.
es: Estos `JST-PH de 4 pines <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485> Los conectores de estilo `_ se utilizan para conectar sensores I2C. Cada puerto es un solo bus I2C donde se pueden conectar múltiples sensores. El uso de sensores con direcciones idénticas en el mismo bus puede causar problemas. La gama de sensores I2C que se pueden conectar está limitada por :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> `. Si bien es posible utilizar una amplia gama de sensores, la gran mayoría de los sensores I2C no tienen controladores integrados en el SDK. Es posible utilizar drivers comunitarios o crear uno propio. Para obtener más información sobre este puerto, consulte `Documentación del puerto REV I2C <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#i2c-port-specifications> `_.

source: These 3-pin `JST-PH <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485>`_ style connectors are used for serial communication between REV Hubs. You would use this port if you wished to use a second REV Hub as described :ref:`in this tutorial <hardware_and_software_configuration/configuring/configuring_dual_hubs/configuring-dual-hubs:using two expansion hubs>`. Both RS485 ports can be used to add redundancy by using two cables connecting both ports between the REV Hubs.
es: Estos `JST-PH de 3 pines <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485> Los conectores de estilo `_ se utilizan para la comunicación en serie entre los concentradores REV. Usaría este puerto si deseara usar un segundo REV Hub como se describe :ref:`en este tutorial <hardware_and_software_configuration/configuring/configuring_dual_hubs/configuring-dual-hubs:using two expansion hubs> `. Ambos puertos RS485 se pueden usar para agregar redundancia usando dos cables que conectan ambos puertos entre los concentradores REV.

source: This connector is used only for **Developer** (non end user) debugging. Its use is not supported by FIRST.
es: Este conector se usa solo para la depuración de **desarrolladores** (no usuarios finales). FIRST no admite su uso.

source: Control Hub Front Ports
es: Puertos frontales del concentrador de control

source: USB-A Ports
es: Puertos USB-A

source: A Control Hub has both a USB 2.0 and 3.0 Type-A female port. This is primarily used for connecting UVC Cameras in acccordance with ``<RE14>``.
es: Un concentrador de control tiene un puerto hembra USB 2.0 y 3.0 tipo A. Esto se usa principalmente para conectar cámaras UVC de acuerdo con ``<RE14> ``.

source: USB-B Port
es: Puerto USB-B

source: On a Control Hub, the USB-mini-B port is used only to communicate directly to the I/O system. In this case, it is only for the purpose of uploading firmware to the device.
es: En un concentrador de control, el puerto USB-mini-B se usa solo para comunicarse directamente con el sistema de E/S. En este caso, es solo con el fin de cargar el firmware en el dispositivo.

source: USB-C Ports
es: Puertos USB-C

source: A Control Hub has a USB-C port. This is primarily used for connecting to a laptop for loading the SDK but can also be used with a UVC Camera in acccordance with ``<RE14>``.
es: Un concentrador de control tiene un puerto USB-C. Esto se usa principalmente para conectarse a una computadora portátil para cargar el SDK, pero también se puede usar con una cámara UVC de acuerdo con ``<RE14> ``.

source: The Control Hub lacks a display of its own even though it is a fully-fledged Android device. The Control Hub has an HDMI port that provides video output for the device; this HDMI port can be used to connect to an external display.
es: El Control Hub carece de una pantalla propia a pesar de que es un dispositivo Android completo. El concentrador de control tiene un puerto HDMI que proporciona salida de video para el dispositivo; este puerto HDMI se puede utilizar para conectarse a una pantalla externa.

source: Expansion Hub Ports
es: Puertos del concentrador de expansión

source: An Android RC phone controls an Expansion Hub through this USB-mini-B port, connected with USB OTG cable. This port also allows firmware updates.
es: Un teléfono Android RC controla un Expansion Hub a través de este puerto USB-mini-B, conectado con un cable USB OTG. Este puerto también permite actualizaciones de firmware.

source: FTC Robot Controller Overview, FTC Docs
es: Descripción general del controlador de robot FTC, FTC Docs

source: A Visual Overview of the FTC Robot Controller
es: Una descripción visual del controlador de robot FTC

source: FTC, FIRST Tech Challenge, RC, Robot Controller, Control Hub, Expansion Hub
es: FTC, FIRST Tech Challenge, RC, controlador de robot, concentrador de control, concentrador de expansión

source: Robot Controller Overview
es: Descripción general del controlador de robot

source: These images represent a basic connection diagram for the components that have typically been included in a standard Robot Starter Kit plus the components purchased from the *FIRST* Storefront (demonstrating components from the REV and Tetrix starter kits, along with the Electronics kit). These configurations show sample connections, and in no way represent the only possible way of connecting these components. In both diagrams is an extra optional REV Expansion Hub that has NOT been included with standard starter kits nor electronics kits; it is included in these diagrams as a sample of how to connect an additional optional REV Expansion Hub if one is available and desired.
es: Estas imágenes representan un diagrama de conexión básico para los componentes que normalmente se han incluido en un kit de inicio de robot estándar más los componentes comprados en *FIRST* Storefront (que muestran los componentes de los kits de inicio de REV y Tetrix, junto con el kit de electrónica). Estas configuraciones muestran conexiones de muestra y de ninguna manera representan la única forma posible de conectar estos componentes. En ambos diagramas hay un concentrador de expansión REV opcional adicional que NO se ha incluido con los kits de inicio estándar ni con los kits electrónicos; se incluye en estos diagramas como una muestra de cómo conectar un concentrador de expansión REV opcional adicional si hay uno disponible y deseado.

source: Click on the headers below to switch between the different control system configuration diagrams.
es: Haga clic en los encabezados a continuación para cambiar entre los diferentes diagramas de configuración del sistema de control.

source: :download:`Control Hub B1 - Basic Config<images/B1.pdf>`
es: :download:`Control Hub B1 - Configuración básica<images/B1.pdf> `

source: Control Hub RC Diagram
es: Diagrama del centro de control RC

source: Android Phone / Hub
es: Teléfono/hub Android

source: :download:`Android Phone A1 - Basic Config<images/A1.pdf>`
es: :download:`Teléfono Android A1 - Configuración básica<images/A1.pdf> `

source: Android Phone RC Diagram
es: Diagrama RC del teléfono Android

source: Motors
es: motores

source: TETRIX 12V DC Motor
es: Motor TETRIX 12V CC

source: TETRIX 12V TorqueNADO DC Motor
es: Motor TETRIX 12V TorqueNADO CC

source: AndyMark 12V DC Motor
es: Motor AndyMark de 12 V CC

source: AndyMark NeveRest series 12V DC Motors
es: Motores de 12 V CC de la serie AndyMark NeveRest

source: MATRIX 12V DC Motors
es: Motores MATRIX 12V DC

source: Modern Robotics/MATRIX 12V DC Motors
es: Robótica moderna/Motores MATRIX de 12 V CC

source: REV 12V DC Motor
es: Motor REV 12V CC

source: REV Robotics HD Hex 12V DC Motor
es: REV Robotics HD Motor hexagonal de 12 V CC

source: REV Robotics Core Hex 12V DC Motor
es: Motor REV Robotics Core Hex de 12 V CC

source: Motors are the primary drivers of a robot. All motors are 12v brushed DC motors and are enumerated in :ref:`Game Manual Part 1 <manuals/game_manuals/game_manuals:game manuals>`. They may only be controlled via a REV Expansion Hub, REV Control Hub, REV SPARKmini Motor Controller, or VEX Motor Controller 29. ``<RE09>``
es: Los motores son los principales impulsores de un robot. Todos los motores son motores de CC con escobillas de 12 V y se enumeran en :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> `. Solo se pueden controlar a través de un concentrador de expansión REV, un concentrador de control REV, un controlador de motor REV SPARKmini o un controlador de motor VEX 29. ``<RE09> ``

source: :ref:`Port Overview <control_hard_compon/rc_components/hub/ports/ch-ports:motor ports>`
es: :ref:`Vista general del puerto<control_hard_compon/rc_components/hub/ports/ch-ports:motor ports> `

source: :ref:`Connecting Motors <hardware_and_software_configuration/connecting_devices/connecting_motor/connecting-motor:connecting a motor to the hub>`
es: :ref:`Conexión de motores <hardware_and_software_configuration/connecting_devices/connecting_motor/connecting-motor:connecting a motor to the hub> `

source: :ref:`Configuring Motors <hardware_and_software_configuration/configuring/configuring_dc_motor/configuring-dc-motor:configuring a dc motor>`
es: :ref:`Configuración de motores <hardware_and_software_configuration/configuring/configuring_dc_motor/configuring-dc-motor:configuring a dc motor> `

source: Power Distribution
es: Distribución de poder

source: Robot Main Battery
es: Batería principal del robot

source: TETRIX 12V Battery
es: Batería TETRIX 12V

source: TETRIX (W39057, formally 739023)
es: TETRIX (W39057, formalmente 739023)

source: MATRIX 12V Battery
es: Batería MATRIZ 12V

source: Modern Robotics/MATRIX (14-0014)
es: Robótica moderna/MATRIZ (14-0014)

source: REV 12V Battery
es: Batería REV 12V

source: REV Robotics (REV-31-1302)
es: Robótica REV (REV-31-1302)

source: The main power of a robot comes from one 12v battery. The battery may be one of the batteries shown above. Refer to section ``<RE03>`` in the :ref:`Game Manual Part 1<manuals/game_manuals/game_manuals:game manuals>` for exact information on allowed batteries. Note that it is typically allowed by ``<RE15>`` to replace the connector on the batteries, provided the in-line fuse on the battery is preserved.
es: La energía principal de un robot proviene de una batería de 12v. La batería puede ser una de las baterías que se muestran arriba. Consulte la sección ``<RE03> `` en el :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> ` para obtener información exacta sobre las baterías permitidas. Tenga en cuenta que normalmente está permitido por ``<RE15> `` para reemplazar el conector de las baterías, siempre que se conserve el fusible en línea de la batería.

source: Be sure to remove the 20A fuse from the in-line fuse holder prior to cutting any wires/connectors if/when replacing the factory default battery connector.
es: Asegúrese de quitar el fusible de 20 A del portafusibles en línea antes de cortar los cables/conectores si reemplaza el conector de batería predeterminado de fábrica.

source: Main Power Switch
es: Interruptor principal

source: REV Power Switch
es: Interruptor de encendido REV

source: TETRIX Power Switch
es: Interruptor de alimentación TETRIX

source: TETRIX (part # W39129)
es: TETRIX (n.º de pieza W39129)

source: MATRIX Power Switch
es: Interruptor de alimentación MATRIZ

source: MATRIX (part #50-0030)
es: MATRIZ (parte #50-0030)

source: One Main Power Switch must control all power provided by the Main Battery. It along with its label should be placed in accordance to :ref:`Game Manual Part 1<manuals/game_manuals/game_manuals:game manuals>`. The legal power switches are shown above. ``<RE01>``
es: Un interruptor de alimentación principal debe controlar toda la energía proporcionada por la batería principal. Debe colocarse junto con su etiqueta de acuerdo con :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> `. Los interruptores de energía legales se muestran arriba. ``<RE01> ``

source: :download:`Power Switch Label <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/power-button-labels.pdf>`
es: :descargar:`Etiqueta del interruptor de encendido <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/power-button-labels.pdf> `

source: Power Distribution Block
es: Bloque de distribución de energía

source: REV XT30 Power Distribution Block
es: Bloque de distribución de energía REV XT30

source: Power Distribution Blocks help to distribute the power to devices such as Control Hubs, SPARKminis, and more. See :ref:`Game Manual Part 1<manuals/game_manuals/game_manuals:game manuals>` for a description of legal Power Distribution methods. The REV XT30 Power Distribution Block shown is only one option for distributing power, and is not the only legal device for power distribution.
es: Los bloques de distribución de energía ayudan a distribuir la energía a dispositivos como concentradores de control, SPARKminis y más. Ver :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> ` para una descripción de los métodos legales de distribución de energía. El bloque de distribución de energía REV XT30 que se muestra es solo una opción para distribuir energía y no es el único dispositivo legal para la distribución de energía.

source: REV Servo Power Module
es: Módulo de potencia servo REV

source: This is an electronic device that boosts the power supplied to 3-wire servos. A REV Servo Power Module has 6 input servo ports and 6 matching output ports. It draws power from a 12V source and provides 6V power to each output servo port. A REV Servo Power Module can provide up to 15A of current across all output servo ports for a total of 90 Watts of power per module.
es: Este es un dispositivo electrónico que aumenta la potencia suministrada a los servos de 3 hilos. Un módulo de alimentación servo REV tiene 6 puertos servo de entrada y 6 puertos de salida correspondientes. Obtiene energía de una fuente de 12 V y proporciona energía de 6 V a cada puerto servo de salida. Un módulo de potencia servo REV puede proporcionar hasta 15 A de corriente en todos los puertos servo de salida para un total de 90 vatios de potencia por módulo.

source: Commercial USB Battery Pack
es: Paquete de batería USB comercial

source: A commercial USB battery pack is an auxiliary power source that can be used in specific situations in accordance with the :ref:`Game Manuals<manuals/game_manuals/game_manuals:game manuals>`
es: Un paquete de baterías USB comercial es una fuente de alimentación auxiliar que se puede utilizar en situaciones específicas de acuerdo con los :ref:`Manuales del juego.<manuals/game_manuals/game_manuals:game manuals> `

source: Sensors
es: Sensores

source: As per :ref:`Game Manual Part 1<manuals/game_manuals/game_manuals:game manuals>` a UVC Webcam is not considered a sensor.
es: Según :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> ` una cámara web UVC no se considera un sensor.

source: Listed below are some examples of common robot sensors. This is not intended to limit or extend in any way the scope of sensors as established in ``<RE12>``. While the *FIRST* Tech Challenge SDK supports many sensors not all are natively supported.
es: A continuación se enumeran algunos ejemplos de sensores de robot comunes. Esto no tiene la intención de limitar o ampliar de ninguna manera el alcance de los sensores según lo establecido en ``<RE12> ``. Si bien el *FIRST* Tech Challenge SDK es compatible con muchos sensores, no todos son compatibles de forma nativa.

source: Examples
es: Ejemplos

source: Distance Sensor (Ultrasonic)
es: Sensor de distancia (ultrasónico)

source: MaxBotix I2C Ultrasonic Sensor
es: Sensor ultrasónico MaxBotix I2C

source: An Ultrasonic Distance Sensor is a device that is able to measure the distance between an object and the sensor. It does this by sending out a sound wave and measuring the time it takes for the wave to travel to the object and back. Using this and the speed of sound the distance can be calculated.
es: Un sensor de distancia ultrasónico es un dispositivo que puede medir la distancia entre un objeto y el sensor. Lo hace enviando una onda de sonido y midiendo el tiempo que tarda la onda en viajar al objeto y regresar. Usando esto y la velocidad del sonido se puede calcular la distancia.

source: Distance Sensor (Optical)
es: Sensor de distancia (óptico)

source: REV 2m Distance Sensor
es: Sensor de distancia REV 2m

source: An Optical Time of Flight (ToF) Sensor is a device that is able to measure the distance between an object and the sensor. It does this by sending out a light beam and measuring the time it takes for the beam to travel to the object and back. Using this time and the known speed of light the distance can be calculated. Be aware that the way the object in question interacts with light can change the accuracy of the distance measurement. A transparent object like field panels will often provide inaccurate measurements.
es: Un sensor óptico de tiempo de vuelo (ToF) es un dispositivo que puede medir la distancia entre un objeto y el sensor. Lo hace enviando un haz de luz y midiendo el tiempo que tarda el haz en viajar al objeto y regresar. Usando este tiempo y la velocidad conocida de la luz se puede calcular la distancia. Tenga en cuenta que la forma en que el objeto en cuestión interactúa con la luz puede cambiar la precisión de la medición de la distancia. Un objeto transparente como los paneles de campo a menudo proporcionará mediciones inexactas.

source: Color Sensor
es: sensor de color

source: REV Color Sensor
es: Sensor de color REV

source: Modern Robotics Color Sensor
es: Sensor de color de robótica moderna

source: A color sensor is usually a digital output device that is able to measure the color of an object. Most color sensors require the object in question to be relatively close to the sensor.
es: Un sensor de color suele ser un dispositivo de salida digital que puede medir el color de un objeto. La mayoría de los sensores de color requieren que el objeto en cuestión esté relativamente cerca del sensor.

source: Touch Sensor
es: Sensor tactil

source: REV Touch Sensor
es: Sensor táctil REV

source: A touch sensor is a digital output device that detects the activation of a button. This can be used as a limit switch, a way to limit the range of motion of a mechanism. Such a device would typically use the digital port.
es: Un sensor táctil es un dispositivo de salida digital que detecta la activación de un botón. Esto se puede usar como un interruptor de límite, una forma de limitar el rango de movimiento de un mecanismo. Dicho dispositivo normalmente usaría el puerto digital.

source: Magnetic Limit Switch
es: Interruptor de límite magnético

source: REV Magnetic Limit Switch
es: Interruptor de límite magnético REV
