Repository: FIRST-Tech-Challenge/ftcdocs-translations
Catalog: locale/*/LC_MESSAGES/control_hard_compon.po
Languages: es

source: Driver Station Components
es: Componentes de la estación del conductor

source: Android Device
es: Dispositivo Android

source: REV Driver Hub
es: Centro de controlador REV

source: REV Driver Hub (REV-31-1596)
es: Centro del controlador REV (REV-31-1596)

source: Android Smartphone
es: Teléfono inteligente Android

source: Moto E5
es: motorola e5

source: The heart of the Driver Station is the Android Device that runs the Driver Station App. This Android Device requirement can be fulfilled either through the use of a `REV Driver Hub <https://www.revrobotics.com/rev-31-1596/>`_ or one of the approved Android Smartphones listed in :doc:`Game Manual 1 <../../../manuals/game_manuals/game_manuals>`. It is of vital importance that the Driver Station App be updated to a version that meets or exceeds the minimum Driver Station App version as defined in :doc:`Game Manual 1 <../../../manuals/game_manuals/game_manuals>`.
es: El corazón de Driver Station es el dispositivo Android que ejecuta la aplicación Driver Station. Este requisito de dispositivo Android se puede cumplir mediante el uso de un `REV Driver Hub<https://www.revrobotics.com/rev-31-1596/> `_ o uno de los teléfonos inteligentes Android aprobados que se enumeran en :doc:` Manual del juego 1 &lt;../../../manuals/game_manuals/game_manuals&gt;`. Es de vital importancia que la aplicación Driver Station se actualice a una versión que cumpla o exceda la versión mínima de la aplicación Driver Station como se define en :doc:`Manual del juego 1 &lt;../../../manuals/game_manuals/game_manuals &gt;`.

source: USB-OTG Adapter / Hubs
es: Adaptadores / concentradores USB-OTG

source: USB OTG Cable
es: Cable USB OTG

source: USB OTG Adapter Cable
es: Cable adaptador USB OTG

source: USB Hub
es: Concentrador USB

source: USBHub
es: Concentrador USB

source: Anker USB Hub
es: Concentrador USB Anker

source: USB OTG Hub
es: Concentrador USB OTG

source: If the Android Device being used is an Android Smartphone, the smartphone only provides a single USB-Micro-B port on the bottom of the phone. In order to use USB devices with the Android Smartphone, like a gamepad, a USB-OTG Adapter Cable must be used. This cable provides a USB Type A port for the Gamepad or peripherals (like a USB Hub, to allow more than one Gamepad to be used). If available, it is instead recommended to use a USB Hub with OTG cable built in, like the `REV UltraUSB (REV-31-1592) <https://www.revrobotics.com/rev-31-1592/>`_ - this reduces the number of connections and failure points in the system.
es: Si el dispositivo Android que se utiliza es un teléfono inteligente Android, el teléfono inteligente solo proporciona un único puerto USB-Micro-B en la parte inferior del teléfono. Para usar dispositivos USB con el teléfono inteligente Android, como un gamepad, se debe usar un cable adaptador USB-OTG. Este cable proporciona un puerto USB tipo A para Gamepad o periféricos (como un concentrador USB, para permitir el uso de más de un Gamepad). Si está disponible, se recomienda utilizar un concentrador USB con cable OTG incorporado, como el `REV UltraUSB (REV-31-1592)<https://www.revrobotics.com/rev-31-1592/> `_ - esto reduce el número de conexiones y puntos de falla en el sistema.

source: When using a REV Driver Hub, no OTG adapters are necessary - gamepads may connect directly to one of the three USB-A ports on the device.
es: Cuando se usa un concentrador de controladores REV, no se necesitan adaptadores OTG: los gamepads pueden conectarse directamente a uno de los tres puertos USB-A del dispositivo.

source: Comercial USB Battery Pack
es: Paquete de batería USB comercial

source: USB Battery Pack
es: Paquete de batería USB

source: Anker Battery Pack
es: Paquete de batería Anker

source: A commercial USB battery pack is an auxiliary power source that can be used in specific situations in accordance with the :ref:`Game Manuals<manuals/game_manuals/game_manuals:game manuals>`. A USB battery pack is permitted to be used to charge your Android Device. Only the REV Driver Hub can be charged while in use, through its USB-C port.
es: Un paquete de baterías USB comercial es una fuente de alimentación auxiliar que se puede utilizar en situaciones específicas de acuerdo con los :ref:`Manuales del juego.<manuals/game_manuals/game_manuals:game manuals> `. Se permite el uso de un paquete de batería USB para cargar su dispositivo Android. Solo el REV Driver Hub se puede cargar mientras está en uso, a través de su puerto USB-C.

source: Gamepads
es: mandos

source: Logitech F310 Gamepad
es: Mando para juegos Logitech F310

source: Xbox 360 Gamepad
es: Mando Xbox 360

source: Sony DualShock 4 Gamepad
es: Mando para juegos Sony DualShock 4

source: Etpark PS4 Wired
es: Etpark PS4 con cable

source: Etpark PS4
es: Parque PS4

source: Etpark PS4 Wired Gamepad
es: Mando con cable Etpark PS4

source: Quadstick
es: cuádruple

source: Quadstick FPS
es: FPS de cuatro palos

source: :ref:`Game Manual 1 <manuals/game_manuals/game_manuals:game manuals>` defines the gamepads that are allowed in competition play. Up to two gamepads, in any combination, of the allowed types of gamepads may be used. All gamepads MUST be used in wired mode only, no wireless of any kind is allowed. Special features of some gamepads (Rumble, Lighting) may be programmed and used by teams for notifications and signaling to the drivers of the robot.
es: :ref:`Manual del juego 1<manuals/game_manuals/game_manuals:game manuals> ` define los gamepads que están permitidos en el juego de competición. Se pueden usar hasta dos gamepads, en cualquier combinación, de los tipos de gamepads permitidos. Todos los gamepads DEBEN usarse solo en modo cableado, no se permite ningún tipo de conexión inalámbrica. Los equipos pueden programar y usar funciones especiales de algunos gamepads (Rumble, Lighting) para notificaciones y señales a los conductores del robot.

source: Driver Station Overview
es: Descripción general de la estación del conductor

source: An overview of the various components of the FTC Driver Station
es: Una descripción general de los diversos componentes de la FTC Driver Station

source: These images represent a basic connection diagram for the components that have typically been used to create a Driver Station. These components have typically been purchased from the *FIRST* Storefront (in the "Control and Communication" kit). These configurations show sample connections, and in no way represent the only possible way of connecting these components. These images also do not represent using a `Driver Station Carrier <https://www.thingiverse.com/thing:3386378>`_, which is recommended for teams to use for component management and transportation. See rule ``DS07`` in :doc:`Game Manual 1 <../../manuals/game_manuals/game_manuals>` for more information on Driver Station Carriers.
es: Estas imágenes representan un diagrama de conexión básico para los componentes que normalmente se han utilizado para crear una Driver Station. Estos componentes normalmente se han comprado en la tienda *FIRST* (en el kit &quot;Control y comunicación&quot;). Estas configuraciones muestran conexiones de muestra y de ninguna manera representan la única forma posible de conectar estos componentes. Estas imágenes tampoco representan el uso de un portador de estación de conductor.<https://www.thingiverse.com/thing:3386378> `_, que se recomienda que los equipos utilicen para la gestión y el transporte de componentes. Consulte la regla ``DS07`` en :doc:`Manual de juego 1 &lt;../../manuals/game_manuals/game_manuals&gt;` para obtener más información sobre los soportes de la estación del conductor.

source: Driver Station
es: Estación del conductor

source: :download:`Driver Station C1 - Basic Config<images/C1.pdf>`
es: :download:`Driver Station C1 - Configuración básica<images/C1.pdf> `

source: Driver Station Image
es: Imagen de la estación del conductor

source: Diagram courtesy of FRC Team 3161 and Stefen Acepcion
es: Diagrama cortesía de FRC Team 3161 y Stefen Acepcion

source: License
es: Licencia

source: :download:`License and Attribution<../license/sa_license.pdf>`
es: :download:`Licencia y Atribución&lt;../license/sa_license.pdf&gt;`

source: License Info
es: Información de licencia

source: Hardware Component Overview
es: Descripción general de los componentes de hardware

source: A detailed overview of the hardware components present in the FTC Control System
es: Una descripción detallada de los componentes de hardware presentes en el sistema de control de la FTC

source: FTC Docs, FIRST Tech Challenge, FTC, Hardware Component, Control System, Overview
es: FTC Docs, FIRST Tech Challenge, FTC, componente de hardware, sistema de control, descripción general

source: The *FIRST* Tech Challenge Control System is divided into two main components: the Driver Station (DS) and the Robot Controller (RC). This section will give you a brief introduction to the hardware components, their various configurations, and connections.
es: El sistema de control *FIRST* Tech Challenge se divide en dos componentes principales: la estación del conductor (DS) y el controlador de robot (RC). Esta sección le brindará una breve introducción a los componentes de hardware, sus diversas configuraciones y conexiones.

source: Encoders (Rotation Counters)
es: Codificadores (contadores de rotación)

source: REV HD Hex Motor
es: Motor hexagonal REV HD

source: Built-in Encoder in the REV HD Hex Motor
es: Codificador integrado en el motor hexagonal REV HD

source: REV Through Bore Encoder
es: REV a través del codificador de orificio

source: REV Through Bore Encoder, in incremental mode.
es: REV Through Bore Encoder, en modo incremental.

source: An encoder is a device that measures the rotational displacement around an axis. Most legal *FIRST* Tech Challenge motors contain a built in quadrature encoder that is compatible with a REV Hub. It is also possible to use a standalone incremental encoder like a REV Through Bore Encoder (shown above). An incremental encoder works by sending out a "tick" per partial rotation of the shaft. More information on how many ticks are output per rotation can be found on the manufacturer's website. An absolute encoder is able to indicate the displacement of the shaft from its starting position and the the exact angle the shaft is currently at relative to a "zero" position.
es: Un codificador es un dispositivo que mide el desplazamiento de rotación alrededor de un eje. La mayoría de los motores *FIRST* Tech Challenge legales contienen un codificador de cuadratura incorporado que es compatible con un REV Hub. También es posible usar un codificador incremental independiente como un codificador REV Through Bore (que se muestra arriba). Un codificador incremental funciona enviando un &quot;tick&quot; por rotación parcial del eje. Puede encontrar más información sobre cuántos ticks se emiten por rotación en el sitio web del fabricante. Un codificador absoluto puede indicar el desplazamiento del eje desde su posición inicial y el ángulo exacto en el que se encuentra actualmente el eje en relación con una posición &quot;cero&quot;.

source: Additional Resources
es: Recursos adicionales

source: :ref:`Encoder Port Overview <control_hard_compon/rc_components/hub/ports/exh-ports:encoder ports>`
es: :ref:`Resumen del puerto del codificador<control_hard_compon/rc_components/hub/ports/exh-ports:encoder ports> `

source: REV Hubs
es: Bujes REV

source: The REV Hubs are the core control units of a *FIRST* Tech Challenge robot.
es: Los REV Hubs son las unidades de control centrales de un robot *FIRST* Tech Challenge.

source: Control Hub
es: Centro de control

source: REV Control Hub (REV-31-1595)
es: Centro de control REV (REV-31-1595)

source: A REV Control Hub combines a REV Expansion Hub with an embedded Android daughterboard connected to it. This means it is able to control all of the hardware components of your robot and also run your actual robot software. This is in contrast to the REV Expansion Hub which was only able to control hardware devices but is not able to to interpret and run the SDK.
es: Un REV Control Hub combina un REV Expansion Hub con una placa secundaria integrada de Android conectada a él. Esto significa que puede controlar todos los componentes de hardware de su robot y también ejecutar su software de robot real. Esto contrasta con REV Expansion Hub, que solo podía controlar dispositivos de hardware pero no podía interpretar ni ejecutar el SDK.

source: Expansion Hub
es: Centro de expansión

source: REV Expansion Hub (REV-31-1153)
es: Centro de expansión REV (REV-31-1153)

source: A REV Expansion Hub is a hub that is used to control all of the hardware components of your robot. It takes the commands your Android Device sends and actually makes it happen. If you want to move a motor, an Expansion Hub is what takes the instruction of moving the motor and actually sends power to the motor in the correct manner. It however does not know when to do this which is where the Android Device comes into play. This device can either be a traditional Android Phone connected via USB or just the embedded device in a Control Hub. When using more than one hub, these hubs can be connected via ``RS485`` or USB. More information can be found :ref:`here <hardware_and_software_configuration/configuring/configuring_dual_hubs/configuring-dual-hubs:using two expansion hubs>`.
es: Un concentrador de expansión REV es un concentrador que se utiliza para controlar todos los componentes de hardware de su robot. Toma los comandos que envía su dispositivo Android y realmente lo hace posible. Si desea mover un motor, un Expansion Hub es lo que toma la instrucción de mover el motor y en realidad envía energía al motor de la manera correcta. Sin embargo, no sabe cuándo hacer esto, que es donde entra en juego el dispositivo Android. Este dispositivo puede ser un teléfono Android tradicional conectado a través de USB o simplemente el dispositivo integrado en un concentrador de control. Cuando se utiliza más de un concentrador, estos concentradores se pueden conectar a través de ``RS485`` o USB. Puede encontrar más información :ref:`aquí <hardware_and_software_configuration/configuring/configuring_dual_hubs/configuring-dual-hubs:using two expansion hubs> `.

source: Control Hub Ports
es: Puertos del concentrador de control

source: Battery Ports
es: Puertos de batería

source: **Never** connect a battery charger directly to the battery port. This will void your warranty and fry your hub.
es: **Nunca** conecte un cargador de batería directamente al puerto de la batería. Esto anulará su garantía y freirá su hub.

source: These `XT-30 <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/xt-30-power-cable>`_ connectors are used to power your REV Hub as well as all the devices connected to it. As the connector is known for its fragility it is highly recommended you be careful when using it. It is also recommended that you expand your connector prongs periodically. For more information on this process please watch this `video <https://www.youtube.com/watch?v=UYXTiSeVmB0>`_. While this video features an XT60, a larger version of the XT-30, and a drone the advice is much the same. This port may also be used to connect a grounding strap. For more information on legal grounding straps see ``<RE15>``, :ref:`Game Manual Part 1 <manuals/game_manuals/game_manuals:game manuals>`. For more information on this port please see `REV Documentation <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#input-power-specifications>`_.
es: Estos `XT-30 <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/xt-30-power-cable> Los conectores `_ se utilizan para alimentar su REV Hub, así como todos los dispositivos conectados a él. Como el conector es conocido por su fragilidad, se recomienda encarecidamente que tenga cuidado al usarlo. También se recomienda que expanda las puntas de su conector periódicamente. Para obtener más información sobre este proceso, mire este `video<https://www.youtube.com/watch?v=UYXTiSeVmB0> `_. Si bien este video presenta un XT60, una versión más grande del XT-30 y un dron, el consejo es muy similar. Este puerto también se puede usar para conectar una correa de puesta a tierra. Para obtener más información sobre correas de puesta a tierra legales, consulte ``<RE15> ``, :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> `. Para obtener más información sobre este puerto, consulte `Documentación REV <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#input-power-specifications> `_.

source: Motor Ports
es: Puertos de motor

source: These `JST-VH <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-vh-motor-power>`_ style connectors are used to power your motors. There are 4 of these ports per hub and they are numbered from 0-3. As you are able to use 8 motors per robot you may want to control more than these hubs allow. In that case it is possible for you to use an :ref:`additional hub<hardware_and_software_configuration/configuring/configuring_dual_hubs/configuring-dual-hubs:using two expansion hubs>` or to use a `REV SPARKmini Motor Controller <https://www.revrobotics.com/rev-31-1230/>`_ (REV-31-1230) to power more motors. For more information on this port please see `REV Motor Port Documentation <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#motor-port-specifications>`_.
es: Estos `JST-VH <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-vh-motor-power> Los conectores de estilo `_ se utilizan para alimentar sus motores. Hay 4 de estos puertos por concentrador y están numerados del 0 al 3. Como puede usar 8 motores por robot, es posible que desee controlar más de lo que permiten estos concentradores. En ese caso, es posible que utilice un concentrador :ref:`adicional <hardware_and_software_configuration/configuring/configuring_dual_hubs/configuring-dual-hubs:using two expansion hubs> ` o para usar un controlador de motor `REV SPARKmini<https://www.revrobotics.com/rev-31-1230/> `_ (REV-31-1230) para impulsar más motores. Para obtener más información sobre este puerto, consulte `Documentación del puerto del motor REV <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#motor-port-specifications> `_.

source: Encoder Ports
es: Puertos de codificador

source: These 4-pin `JST-PH <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485>`_ style connectors are used for your quadrature encoders. There are 4 of these ports on each hub and they can be used in tandem with the motor they are adjacent to. However, it is also possible to use this port to connect to a standalone incremental encoder. To connect to more than 4 encoders it is currently necessary to connect an additional hub. For more information on this port please see `REV Encoder Port Documentation <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#encoder-port-specifications>`_.
es: Estos `JST-PH de 4 pines <https://docs.revrobotics.com/duo-control/control-system-overview/cables-and-connectors/jst-ph-sensors-and-rs485> Los conectores de estilo `_ se utilizan para sus codificadores de cuadratura. Hay 4 de estos puertos en cada concentrador y se pueden usar junto con el motor al que están adyacentes. Sin embargo, también es posible usar este puerto para conectarse a un codificador incremental independiente. Para conectarse a más de 4 codificadores, actualmente es necesario conectar un concentrador adicional. Para obtener más información sobre este puerto, consulte `Documentación del puerto del codificador REV <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#encoder-port-specifications> `_.

source: Servo Ports
es: Puertos para servos

source: These 0.1” Header pins are used to power and control your servos. There are 6 ports on each hub and they are numbered from 0-5. Be mindful of matching the polarity of the device attached to this port as it is possible to flip the connector. For increasing the power supplied to these servos it is possible to use a Servo Power Module that is in compliance with ``<RE05>``, :ref:`Game Manual Part 1 <manuals/game_manuals/game_manuals:game manuals>`. For more information on this port please see `REV Servo Port Documentation <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#servo-port-specifications>`_.
es: Estos pines de encabezado de 0.1 ”se utilizan para alimentar y controlar sus servos. Hay 6 puertos en cada concentrador y están numerados del 0 al 5. Tenga cuidado de hacer coincidir la polaridad del dispositivo conectado a este puerto, ya que es posible voltear el conector. Para aumentar la potencia suministrada a estos servos, es posible utilizar un módulo de potencia de servo que cumpla con ``<RE05> ``, :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> `. Para obtener más información sobre este puerto, consulte `Documentación del puerto REV Servo <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#servo-port-specifications> `_.

source: +5V Power Ports
es: Puertos de alimentación de +5 V

source: These 0.1” Header pins are used to power and control various appliances. There are two ports on each hub. These connectors can be used for a limited range of applications in FIRST Tech Challenge, such as powering powered USB hubs. For more information on this port please see `REV +5V Power Port Documentation <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#+5v-power-port-specifications>`_ and :ref:`Game Manual Part 1 <manuals/game_manuals/game_manuals:game manuals>`.
es: Estos pines de cabecera de 0,1” se utilizan para alimentar y controlar varios aparatos. Hay dos puertos en cada concentrador. Estos conectores se pueden utilizar para una gama limitada de aplicaciones en FIRST Tech Challenge, como la alimentación de concentradores USB con alimentación. Para obtener más información sobre este puerto, consulte la documentación del puerto de alimentación `REV +5V <https://docs.revrobotics.com/duo-control/control-system-overview/control-hub-basics#+5v-power-port-specifications> `_ y :ref:`Manual del juego Parte 1<manuals/game_manuals/game_manuals:game manuals> `.

source: Analog Ports
es: Puertos Analógicos
