Repository: FIRST-Tech-Challenge/ftcdocs-translations
Catalog: locale/*/LC_MESSAGES/programming_resources/android_studio_java/Android-Studio-Tutorial.po
Languages: es

source: Tutorials
es: Tutoriales

source: Android Studio Programming Tutorial
es: Tutorial de programación de Android Studio

source: This tutorial will take you step-by-step through the process of configuring, programming, and operating your Control System. This tutorial uses Android Studio to help you get started programming your robot.
es: Este tutorial lo guiará paso a paso a través del proceso de configuración, programación y operación de su sistema de control. Este tutorial utiliza Android Studio para ayudarlo a comenzar a programar su robot.

source: Android Studio is an advanced integrated development environment for creating Android apps. This tool is the same tool that professional Android app developers use. Android Studio is only recommended for **advanced users** who have **extensive Java programming experience**.
es: Android Studio es un entorno de desarrollo integrado avanzado para crear aplicaciones de Android. Esta herramienta es la misma herramienta que usan los desarrolladores profesionales de aplicaciones de Android. Android Studio solo se recomienda para **usuarios avanzados** que tienen **amplia experiencia en programación Java**.

source: Introduction
es: Introducción

source: :doc:`The Control System <../shared/control_system_intro/The-FTC-Control-System>`
es: :doc:`El Sistema de Control <../shared/control_system_intro/The-FTC-Control-System>`

source: :doc:`Required Materials <../shared/required_materials/Required-Materials>`
es: :doc:`Materiales requeridos <../shared/required_materials/Required-Materials>`

source: :doc:`Using Your Android Device <../shared/using_android_device/Using-Your-Android-Device>`
es: :doc:`Uso de su dispositivo Android <../shared/using_android_device/Using-Your-Android-Device>`

source: Configuring Your Hardware
es: Configuración de su hardware

source: :doc:`Configuring Your Android Devices <../shared/configuring_android/Configuring-Your-Android-Devices>`
es: :doc:`Configuración de sus dispositivos Android <../shared/configuring_android/Configuring-Your-Android-Devices>`

source: :doc:`Connecting Devices to a Control or Expansion Hub </hardware_and_software_configuration/connecting_devices/index>`
es: :doc:`Conexión de dispositivos a un concentrador de control o expansión</hardware_and_software_configuration/connecting_devices/index> `

source: :doc:`Configuring Your Hardware </hardware_and_software_configuration/connecting_devices/index>`
es: :doc:`Configuración de su hardware</hardware_and_software_configuration/connecting_devices/index> `

source: Installing Android Studio
es: Instalación de Android Studio

source: :doc:`Downloading and Installing Android Studio <../tutorial_specific/android_studio/installing_android_studio/Installing-Android-Studio>`
es: :doc:`Descarga e instalación de Android Studio &lt;../tutorial_specific/android_studio/installing_android_studio/Installing-Android-Studio&gt;`

source: :doc:`Downloading the Android Studio Project <../tutorial_specific/android_studio/downloading_as_project_folder/Downloading-the-Android-Studio-Project-Folder>`
es: :doc:`Descarga del proyecto de Android Studio &lt;../tutorial_specific/android_studio/downloading_as_project_folder/Downloading-the-Android-Studio-Project-Folder&gt;`

source: :bdg-warning:`Legacy` :doc:`Disabling Android Studio Instant Run <../tutorial_specific/android_studio/disable_instant_run/disable-instant-run>`
es: :bdg-warning:`Legacy` :doc:`Deshabilitar Android Studio Instant Run &lt;../tutorial_specific/android_studio/disable_instant_run/disable-instant-run&gt;`

source: Managing an Android Studio Project
es: Administrar un proyecto de Android Studio

source: :bdg-warning:`Legacy` :doc:`Downloading an FTC Android Studio Project <../tutorial_specific/android_studio/downloading_as_project_folder/Downloading-the-Android-Studio-Project-Folder>`
es: :bdg-warning:`Legacy` :doc:`Descarga de un proyecto FTC Android Studio &lt;../tutorial_specific/android_studio/downloading_as_project_folder/Downloading-the-Android-Studio-Project-Folder&gt;`

source: :doc:`Forking/Cloning an FTC Android Studio Project from GitHub <../tutorial_specific/android_studio/fork_and_clone_github_repository/Fork-and-Clone-From-GitHub>`
es: :doc:`Bifurcación/clonación de un proyecto FTC Android Studio desde GitHub &lt;../tutorial_specific/android_studio/fork_and_clone_github_repository/Fork-and-Clone-From-GitHub&gt;`

source: Writing an Op Mode
es: Escribir un modo operativo

source: :doc:`Enabling Developer Options <../tutorial_specific/android_studio/enabling_developer_options/Enabling-Developer-Options>`
es: :doc:`Habilitación de opciones de desarrollador &lt;../tutorial_specific/android_studio/habilitación_developer_options/Enabling-Developer-Options&gt;`

source: :doc:`Creating & Running an Op Mode <../tutorial_specific/android_studio/creating_op_modes/Creating-and-Running-an-Op-Mode-(Android-Studio)>`
es: :doc:`Creación y ejecución de un modo operativo &lt;../tutorial_specific/android_studio/creating_op_modes/Creating-and-Running-an-Op-Mode-(Android-Studio)&gt;`

source: :doc:`Controlling a Servo <../tutorial_specific/android_studio/controlling_a_servo/Controlling-a-Servo-(Android-Studio)>`
es: :doc:`Controlando un Servo &lt;../tutorial_specific/android_studio/controlling_a_servo/Controlling-a-Servo-(Android-Studio)&gt;`

source: :doc:`Using Sensors <../tutorial_specific/android_studio/using_sensors/Using-Sensors-(Android-Studio)>`
es: :doc:`Uso de sensores &lt;../tutorial_specific/android_studio/using_sensors/Using-Sensors-(Android-Studio)&gt;`
