Repository: FIRST-Tech-Challenge/ftcdocs-translations
Catalog: locale/*/LC_MESSAGES/apriltag/opmode_test_images/opmode-test-images.po
Languages: es

source: *FIRST* Tech Challenge AprilTag Testing Samples
es: *FIRST* Tech Challenge Muestras de prueba AprilTag

source: Introduction
es: Introducción

source: In the 2023-2024 season, `FIRST Tech Challenge has introduced AprilTags <https://ftc-docs.firstinspires.org/apriltag-intro>`__ into the season-unique competition. AprilTags were developed by the April Robotics Laboratory at the University of Michigan and are a visual fiducial tagging system, built on a similar concept as QR codes, useful for a wide variety of tasks including augmented reality, robotics, and camera calibration. A properly calibrated camera and tag library can be used to detect AprilTags and provide information such as range and orientation information (also known as **pose** data) about the tags with respect to the camera. The *FIRST* Tech Challenge Software Development Kit (SDK) has been updated to add AprilTag detection APIs to help teams make use of this resource.
es: En la temporada 2023-2024, `FIRST Tech Challenge ha presentado AprilTags<https://ftc-docs.firstinspires.org/apriltag-intro> `__ en la competencia única de la temporada. AprilTags fue desarrollado por April Robotics Laboratory en la Universidad de Michigan y es un sistema de etiquetado fiduciario visual, basado en un concepto similar a los códigos QR, útil para una amplia variedad de tareas que incluyen realidad aumentada, robótica y calibración de cámaras. Se puede usar una cámara y una biblioteca de etiquetas correctamente calibradas para detectar AprilTags y proporcionar información como información de rango y orientación (también conocida como datos de **posición**) sobre las etiquetas con respecto a la cámara. El *FIRST* Tech Challenge Software Development Kit (SDK) se actualizó para agregar las API de detección de AprilTag para ayudar a los equipos a utilizar este recurso.

source: This document contains examples of AprilTags that are intended to be used with the *FIRST* Tech Challenge AprilTag samples within the SDK. All AprilTags used in the 2023-2024 season are from the 36h11 tag family, which is a predetermined set of tags. The primary tag area is comprised of an 8x8 square matrix of black and white *pixels*. The size of the tag is measured based on the physical dimensions of the total black square portion of the tag – a 4 inch AprilTag has a black square portion that measures 4 inches on each side. Even though it is not used in measuring the size of an AprilTag, each tag also requires a white border one *pixel* thick surrounding the primary tag area (bringing the total tag size to 10x10 *pixels*). With the added white border, for example, a 4-inch AprilTag requires a footprint of 5 inches on each side.
es: Este documento contiene ejemplos de AprilTags destinados a usarse con las muestras de AprilTag del *FIRST* Tech Challenge dentro del SDK. Todos los AprilTags utilizados en la temporada 2023-2024 son de la familia de etiquetas 36h11, que es un conjunto predeterminado de etiquetas. El área de la etiqueta principal se compone de una matriz cuadrada de 8x8 de *píxeles* en blanco y negro. El tamaño de la etiqueta se mide en función de las dimensiones físicas de la porción cuadrada negra total de la etiqueta: una AprilTag de 4 pulgadas tiene una porción cuadrada negra que mide 4 pulgadas en cada lado. Aunque no se utiliza para medir el tamaño de una AprilTag, cada etiqueta también requiere un borde blanco de un *píxel* de grosor alrededor del área de la etiqueta principal (lo que eleva el tamaño total de la etiqueta a 10x10 *píxeles*). Con el borde blanco agregado, por ejemplo, un AprilTag de 4 pulgadas requiere una huella de 5 pulgadas en cada lado.

source: AprilTag Sizing
es: Tamaño de la etiqueta de abril

source: Example sizing for 4-inch AprilTag
es: Tamaño de ejemplo para AprilTag de 4 pulgadas

source: The AprilTag API for *FIRST* Tech Challenge can handle multiple tag sizes; each individual tag can be sized independently, but there cannot be multiple sizes for an individual tag. Some pose information calculated for each tag, such as distance from camera to tag data, requires knowing the exact size of the tags being used. The default tag sizes used with the sample programs within the SDK are as follows:
es: La API AprilTag para *FIRST* Tech Challenge puede manejar múltiples tamaños de etiquetas; cada etiqueta individual puede tener un tamaño independiente, pero no puede haber varios tamaños para una etiqueta individual. Cierta información de pose calculada para cada etiqueta, como la distancia de la cámara a los datos de la etiqueta, requiere conocer el tamaño exacto de las etiquetas que se utilizan. Los tamaños de etiqueta predeterminados que se usan con los programas de muestra dentro del SDK son los siguientes:

source: **Tag Description**
es: **Descripción de la etiqueta**

source: **Size of Tag in Inches (millimeters)**
es: **Tamaño de la etiqueta en pulgadas (milímetros)**

source: Tag ID: 583 (AKA “Nemo”)
es: ID de etiqueta: 583 (también conocido como &quot;Nemo&quot;)

source: 4 in (101.6 mm)
es: 4 pulgadas (101,6 mm)

source: Tag ID: 584 (AKA “Jonah”)
es: ID de etiqueta: 584 (alias &quot;Jonás&quot;)

source: Tag ID: 585 (AKA “Cousteau”)
es: ID de etiqueta: 585 (también conocido como &quot;Cousteau&quot;)

source: 6 in (152.4 mm)
es: 6 pulgadas (152,4 mm)

source: Tag ID: 586 (AKA “Ariel”)
es: ID de etiqueta: 586 (alias &quot;Ariel&quot;)

source: When printing out the :download:`PDF version of this document <files/FTCAprilTagSDK82SamplesExtended.pdf>`, or portions thereof, please set the Page Size settings to “Actual Size” to ensure that the tags are printed properly. Every printer is slightly different, so it’s also a good idea to measure the width and height of the black-square portion of the main tag area to verify that the page printed properly.
es: Al imprimir la versión :download:`PDF de este documento<files/FTCAprilTagSDK82SamplesExtended.pdf> `, o partes del mismo, establezca la configuración de Tamaño de página en &quot;Tamaño real&quot; para asegurarse de que las etiquetas se impriman correctamente. Cada impresora es ligeramente diferente, por lo que también es una buena idea medir el ancho y el alto de la parte del cuadrado negro del área de la etiqueta principal para verificar que la página se imprimió correctamente.

source: Printing Document
es: Documento de impresión

source: Example printing settings for printing PDF at Actual Size
es: Configuración de impresión de ejemplo para imprimir PDF en tamaño real

source: For more in-depth information about AprilTag detection values, and better understanding what they mean, please visit the following website:
es: Para obtener información más detallada sobre los valores de detección de AprilTag y comprender mejor lo que significan, visite el siguiente sitio web:

source: :download:`Download and print the official PDF <files/FTCAprilTagSDK82SamplesExtended.pdf>`
es: :download:`Descarga e imprime el PDF oficial<files/FTCAprilTagSDK82SamplesExtended.pdf> `

source: AprilTags
es: abrilEtiquetas

source: You can point your camera at these tags for recognition - ftc-docs does allow stretching of the image, so the image may not clearly and correctly be represented if the width of the display area is less than the width of the image. It is recommended to :download:`download and print the official PDF <files/FTCAprilTagSDK82SamplesExtended.pdf>`.
es: Puede apuntar su cámara a estas etiquetas para reconocerlas: ftc-docs permite estirar la imagen, por lo que es posible que la imagen no se represente clara y correctamente si el ancho del área de visualización es menor que el ancho de la imagen. Se recomienda :download:`descargar e imprimir el PDF oficial<files/FTCAprilTagSDK82SamplesExtended.pdf> `.
